"""
Напишите template строки, который можно будет многократно переиспользовать,
вставляя в него имя и фамилию человека. Используйте метод строки "format"
"""

full_name = "{} {}"
print(full_name.format("Peter", "Parker"))
